FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC17xx_40xx GPIO Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPIO.h>
#include <stdio.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 *iIOPIN;
    TVUInt32 *iIOSET;
    TVUInt32 *iIOCLR;
    TVUInt32 *iIODIR;
    TVUInt32 *iIOIntEnR;
    TVUInt32 *iIOIntEnF;
    TVUInt32 *iIOIntStatR;
    TVUInt32 *iIOIntStatF;
    TVUInt32 *iIOIntClr;
    TVUInt32 *iIOCONTable[32];
} LPC17xx_40xx_GPIO_PortInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const LPC17xx_40xx_GPIO_PortInfo *iPortInfo;
    T_gpioInterruptHandler iInterruptCallback;
    void *iInterruptCallbackWorkspace;
    TUInt32 iLocked;
} T_LPC17xx_40xx_GPIO_Workspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_GPIO_ProcessIRQ(T_LPC17xx_40xx_GPIO_Workspace *p);

/*---------------------------------------------------------------------------*
 * Globals and Tables:
 *---------------------------------------------------------------------------*/
const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port0_PortInfo
= {
    (TUInt32 *)&LPC_GPIO0->PIN,
    (TUInt32 *)&LPC_GPIO0->SET,
    (TUInt32 *)&LPC_GPIO0->CLR,
    (TUInt32 *)&LPC_GPIO0->DIR,
    (TUInt32 *)&LPC_GPIOINT->IO0IntEnR,
    (TUInt32 *)&LPC_GPIOINT->IO0IntEnF,
    (TUInt32 *)&LPC_GPIOINT->IO0IntStatR,
    (TUInt32 *)&LPC_GPIOINT->IO0IntStatF,
    (TUInt32 *)&LPC_GPIOINT->IO0IntClr,
    {
        (TUInt32 *)&LPC_IOCON->P0_0,
        (TUInt32 *)&LPC_IOCON->P0_1,
        (TUInt32 *)&LPC_IOCON->P0_2,
        (TUInt32 *)&LPC_IOCON->P0_3,
        (TUInt32 *)&LPC_IOCON->P0_4,
        (TUInt32 *)&LPC_IOCON->P0_5,
        (TUInt32 *)&LPC_IOCON->P0_6,
        (TUInt32 *)&LPC_IOCON->P0_7,
        (TUInt32 *)&LPC_IOCON->P0_8,
        (TUInt32 *)&LPC_IOCON->P0_9,
        (TUInt32 *)&LPC_IOCON->P0_10,
        (TUInt32 *)&LPC_IOCON->P0_11,
        (TUInt32 *)&LPC_IOCON->P0_12,
        (TUInt32 *)&LPC_IOCON->P0_13,
        (TUInt32 *)&LPC_IOCON->P0_14,
        (TUInt32 *)&LPC_IOCON->P0_15,
        (TUInt32 *)&LPC_IOCON->P0_16,
        (TUInt32 *)&LPC_IOCON->P0_17,
        (TUInt32 *)&LPC_IOCON->P0_18,
        (TUInt32 *)&LPC_IOCON->P0_19,
        (TUInt32 *)&LPC_IOCON->P0_20,
        (TUInt32 *)&LPC_IOCON->P0_21,
        (TUInt32 *)&LPC_IOCON->P0_22,
        (TUInt32 *)&LPC_IOCON->P0_23,
        (TUInt32 *)&LPC_IOCON->P0_24,
        (TUInt32 *)&LPC_IOCON->P0_25,
        (TUInt32 *)&LPC_IOCON->P0_26,
        (TUInt32 *)&LPC_IOCON->P0_27,
        (TUInt32 *)&LPC_IOCON->P0_28,
        (TUInt32 *)&LPC_IOCON->P0_29,
        (TUInt32 *)&LPC_IOCON->P0_30,
        (TUInt32 *)&LPC_IOCON->P0_31,
    }
};

const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port1_PortInfo = {
        (TUInt32 *)&LPC_GPIO1->PIN,
        (TUInt32 *)&LPC_GPIO1->SET,
        (TUInt32 *)&LPC_GPIO1->CLR,
        (TUInt32 *)&LPC_GPIO1->DIR,
        0,
        0,
        0,
        0,
        0,
        {
                (TUInt32 *)&LPC_IOCON->P1_0,
                (TUInt32 *)&LPC_IOCON->P1_1,
                (TUInt32 *)&LPC_IOCON->P1_2,
                (TUInt32 *)&LPC_IOCON->P1_3,
                (TUInt32 *)&LPC_IOCON->P1_4,
                (TUInt32 *)&LPC_IOCON->P1_5,
                (TUInt32 *)&LPC_IOCON->P1_6,
                (TUInt32 *)&LPC_IOCON->P1_7,
                (TUInt32 *)&LPC_IOCON->P1_8,
                (TUInt32 *)&LPC_IOCON->P1_9,
                (TUInt32 *)&LPC_IOCON->P1_10,
                (TUInt32 *)&LPC_IOCON->P1_11,
                (TUInt32 *)&LPC_IOCON->P1_12,
                (TUInt32 *)&LPC_IOCON->P1_13,
                (TUInt32 *)&LPC_IOCON->P1_14,
                (TUInt32 *)&LPC_IOCON->P1_15,
                (TUInt32 *)&LPC_IOCON->P1_16,
                (TUInt32 *)&LPC_IOCON->P1_17,
                (TUInt32 *)&LPC_IOCON->P1_18,
                (TUInt32 *)&LPC_IOCON->P1_19,
                (TUInt32 *)&LPC_IOCON->P1_20,
                (TUInt32 *)&LPC_IOCON->P1_21,
                (TUInt32 *)&LPC_IOCON->P1_22,
                (TUInt32 *)&LPC_IOCON->P1_23,
                (TUInt32 *)&LPC_IOCON->P1_24,
                (TUInt32 *)&LPC_IOCON->P1_25,
                (TUInt32 *)&LPC_IOCON->P1_26,
                (TUInt32 *)&LPC_IOCON->P1_27,
                (TUInt32 *)&LPC_IOCON->P1_28,
                (TUInt32 *)&LPC_IOCON->P1_29,
                (TUInt32 *)&LPC_IOCON->P1_30,
                (TUInt32 *)&LPC_IOCON->P1_31, }

};

const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port2_PortInfo
= {
    (TUInt32 *)&LPC_GPIO2->PIN,
    (TUInt32 *)&LPC_GPIO2->SET,
    (TUInt32 *)&LPC_GPIO2->CLR,
    (TUInt32 *)&LPC_GPIO2->DIR,
    (TUInt32 *)&LPC_GPIOINT->IO2IntEnR,
    (TUInt32 *)&LPC_GPIOINT->IO2IntEnF,
    (TUInt32 *)&LPC_GPIOINT->IO2IntStatR,
    (TUInt32 *)&LPC_GPIOINT->IO2IntStatF,
    (TUInt32 *)&LPC_GPIOINT->IO2IntClr,
    {
        (TUInt32 *)&LPC_IOCON->P2_0,
        (TUInt32 *)&LPC_IOCON->P2_1,
        (TUInt32 *)&LPC_IOCON->P2_2,
        (TUInt32 *)&LPC_IOCON->P2_3,
        (TUInt32 *)&LPC_IOCON->P2_4,
        (TUInt32 *)&LPC_IOCON->P2_5,
        (TUInt32 *)&LPC_IOCON->P2_6,
        (TUInt32 *)&LPC_IOCON->P2_7,
        (TUInt32 *)&LPC_IOCON->P2_8,
        (TUInt32 *)&LPC_IOCON->P2_9,
        (TUInt32 *)&LPC_IOCON->P2_10,
        (TUInt32 *)&LPC_IOCON->P2_11,
        (TUInt32 *)&LPC_IOCON->P2_12,
        (TUInt32 *)&LPC_IOCON->P2_13,
        (TUInt32 *)&LPC_IOCON->P2_14,
        (TUInt32 *)&LPC_IOCON->P2_15,
        (TUInt32 *)&LPC_IOCON->P2_16,
        (TUInt32 *)&LPC_IOCON->P2_17,
        (TUInt32 *)&LPC_IOCON->P2_18,
        (TUInt32 *)&LPC_IOCON->P2_19,
        (TUInt32 *)&LPC_IOCON->P2_20,
        (TUInt32 *)&LPC_IOCON->P2_21,
        (TUInt32 *)&LPC_IOCON->P2_22,
        (TUInt32 *)&LPC_IOCON->P2_23,
        (TUInt32 *)&LPC_IOCON->P2_24,
        (TUInt32 *)&LPC_IOCON->P2_25,
        (TUInt32 *)&LPC_IOCON->P2_26,
        (TUInt32 *)&LPC_IOCON->P2_27,
        (TUInt32 *)&LPC_IOCON->P2_28,
        (TUInt32 *)&LPC_IOCON->P2_29,
        (TUInt32 *)&LPC_IOCON->P2_30,
        (TUInt32 *)&LPC_IOCON->P2_31,
    }
};

