FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPIO.c
const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port3_PortInfo = {
        (TUInt32 *)&LPC_GPIO3->PIN,
        (TUInt32 *)&LPC_GPIO3->SET,
        (TUInt32 *)&LPC_GPIO3->CLR,
        (TUInt32 *)&LPC_GPIO3->DIR,
        0,
        0,
        0,
        0,
        0,
        {
                (TUInt32 *)&LPC_IOCON->P3_0,
                (TUInt32 *)&LPC_IOCON->P3_1,
                (TUInt32 *)&LPC_IOCON->P3_2,
                (TUInt32 *)&LPC_IOCON->P3_3,
                (TUInt32 *)&LPC_IOCON->P3_4,
                (TUInt32 *)&LPC_IOCON->P3_5,
                (TUInt32 *)&LPC_IOCON->P3_6,
                (TUInt32 *)&LPC_IOCON->P3_7,
                (TUInt32 *)&LPC_IOCON->P3_8,
                (TUInt32 *)&LPC_IOCON->P3_9,
                (TUInt32 *)&LPC_IOCON->P3_10,
                (TUInt32 *)&LPC_IOCON->P3_11,
                (TUInt32 *)&LPC_IOCON->P3_12,
                (TUInt32 *)&LPC_IOCON->P3_13,
                (TUInt32 *)&LPC_IOCON->P3_14,
                (TUInt32 *)&LPC_IOCON->P3_15,
                (TUInt32 *)&LPC_IOCON->P3_16,
                (TUInt32 *)&LPC_IOCON->P3_17,
                (TUInt32 *)&LPC_IOCON->P3_18,
                (TUInt32 *)&LPC_IOCON->P3_19,
                (TUInt32 *)&LPC_IOCON->P3_20,
                (TUInt32 *)&LPC_IOCON->P3_21,
                (TUInt32 *)&LPC_IOCON->P3_22,
                (TUInt32 *)&LPC_IOCON->P3_23,
                (TUInt32 *)&LPC_IOCON->P3_24,
                (TUInt32 *)&LPC_IOCON->P3_25,
                (TUInt32 *)&LPC_IOCON->P3_26,
                (TUInt32 *)&LPC_IOCON->P3_27,
                (TUInt32 *)&LPC_IOCON->P3_28,
                (TUInt32 *)&LPC_IOCON->P3_29,
                (TUInt32 *)&LPC_IOCON->P3_30,
                (TUInt32 *)&LPC_IOCON->P3_31, } };

const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port4_PortInfo = {
        (TUInt32 *)&LPC_GPIO4->PIN,
        (TUInt32 *)&LPC_GPIO4->SET,
        (TUInt32 *)&LPC_GPIO4->CLR,
        (TUInt32 *)&LPC_GPIO4->DIR,
        0,
        0,
        0,
        0,
        0,
        {
                (TUInt32 *)&LPC_IOCON->P4_0,
                (TUInt32 *)&LPC_IOCON->P4_1,
                (TUInt32 *)&LPC_IOCON->P4_2,
                (TUInt32 *)&LPC_IOCON->P4_3,
                (TUInt32 *)&LPC_IOCON->P4_4,
                (TUInt32 *)&LPC_IOCON->P4_5,
                (TUInt32 *)&LPC_IOCON->P4_6,
                (TUInt32 *)&LPC_IOCON->P4_7,
                (TUInt32 *)&LPC_IOCON->P4_8,
                (TUInt32 *)&LPC_IOCON->P4_9,
                (TUInt32 *)&LPC_IOCON->P4_10,
                (TUInt32 *)&LPC_IOCON->P4_11,
                (TUInt32 *)&LPC_IOCON->P4_12,
                (TUInt32 *)&LPC_IOCON->P4_13,
                (TUInt32 *)&LPC_IOCON->P4_14,
                (TUInt32 *)&LPC_IOCON->P4_15,
                (TUInt32 *)&LPC_IOCON->P4_16,
                (TUInt32 *)&LPC_IOCON->P4_17,
                (TUInt32 *)&LPC_IOCON->P4_18,
                (TUInt32 *)&LPC_IOCON->P4_19,
                (TUInt32 *)&LPC_IOCON->P4_20,
                (TUInt32 *)&LPC_IOCON->P4_21,
                (TUInt32 *)&LPC_IOCON->P4_22,
                (TUInt32 *)&LPC_IOCON->P4_23,
                (TUInt32 *)&LPC_IOCON->P4_24,
                (TUInt32 *)&LPC_IOCON->P4_25,
                (TUInt32 *)&LPC_IOCON->P4_26,
                (TUInt32 *)&LPC_IOCON->P4_27,
                (TUInt32 *)&LPC_IOCON->P4_28,
                (TUInt32 *)&LPC_IOCON->P4_29,
                (TUInt32 *)&LPC_IOCON->P4_30,
                (TUInt32 *)&LPC_IOCON->P4_31, } };

const LPC17xx_40xx_GPIO_PortInfo GPIO_LPC17xx_40xx_Port5_PortInfo = {
        (TUInt32 *)&LPC_GPIO5->PIN,
        (TUInt32 *)&LPC_GPIO5->SET,
        (TUInt32 *)&LPC_GPIO5->CLR,
        (TUInt32 *)&LPC_GPIO5->DIR,
        0,
        0,
        0,
        0,
        0,
        {
                (TUInt32 *)&LPC_IOCON->P5_0,
                (TUInt32 *)&LPC_IOCON->P5_1,
                (TUInt32 *)&LPC_IOCON->P5_2,
                (TUInt32 *)&LPC_IOCON->P5_3,
                (TUInt32 *)&LPC_IOCON->P5_4,
                0, /* 5 */
                0, /* 6 */
                0, /* 7 */
                0, /* 8 */
                0, /* 9 */
                0, /* 10 */
                0, /* 11 */
                0, /* 12 */
                0, /* 13 */
                0, /* 14 */
                0, /* 15 */
                0, /* 16 */
                0, /* 17 */
                0, /* 18 */
                0, /* 19 */
                0, /* 20 */
                0, /* 21 */
                0, /* 22 */
                0, /* 23 */
                0, /* 24 */
                0, /* 25 */
                0, /* 26 */
                0, /* 27 */
                0, /* 28 */
                0, /* 29 */
                0, /* 30 */
                0, /* 31 */
        } };

static T_LPC17xx_40xx_GPIO_Workspace *G_LPC17xx_40xxPort0Workspace = 0;
static T_LPC17xx_40xx_GPIO_Workspace *G_LPC17xx_40xxPort2Workspace = 0;

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port0_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC17xx_40xxPort0Workspace = p;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port1_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port2_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC17xx_40xxPort2Workspace = p;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port3 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port3_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port4_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port4_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Port5_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPIO Port5 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Port5_InitializeWorkspace(void *aWorkspace)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC17xx_40xx_Port5_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are usable.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aUsablePins         -- Pins allowed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Configure(void *aWorkspace, TUInt32 aUsablePins)
{
    //    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;

    PARAM_NOT_USED(aUsablePins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Activate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are active as GPIO pins.
 *      Once active, the pins are set to GPIO inputs or outputs.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Activate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_Deactivate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are inactive as GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_Deactivate(void *aWorkspace, TUInt32 aPortPins)
{
    // Defunc function
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    const LPC17xx_40xx_GPIO_PortInfo *p_info = p->iPortInfo;

