FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPIO.c
T_uezError LPC17xx_40xx_GPIO_ClearInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC17xx_40xx_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    TVUInt32 *p_iocon;
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    const LPC17xx_40xx_GPIO_PortInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

    // Look up the IOCON register
    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        case GPIO_CONTROL_ENABLE_INPUT_BUFFER:
            *p_iocon |= (1 << 7);
            break;
        case GPIO_CONTROL_DISABLE_INPUT_BUFFER:
            *p_iocon &= ~(1 << 7);
            break;
        case GPIO_CONTROL_SET_CONFIG_BITS:
            *p_iocon = aValue;
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
#if (COMPILER_TYPE != IAR)
            break;
#endif
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC17xx_40xx_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
#ifndef NDEBUG
    char buffer [50];
#endif
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        #ifndef NDEBUG
          sprintf (buffer, "PinLock on %s Pin %d", p->iHAL->iInterface.iName, aPortPins);
          UEZFailureMsg(buffer);
        #else
          UEZFailureMsg("PinLock");
        #endif
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC17xx_40xx_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC17xx_40xx_GPIO_Workspace *p = (T_LPC17xx_40xx_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_LPC17xx_40xx_Port0_Interface = {
        {
        "LPC17xx_40xx GPIO Port 0",
        0x0106,
        LPC17xx_40xx_GPIO_Port0_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback,
        LPC17xx_40xx_GPIO_EnableInterrupts,
        LPC17xx_40xx_GPIO_DisableInterrupts,
        LPC17xx_40xx_GPIO_ClearInterrupts,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC17xx_40xx_Port1_Interface = {
        {
        "LPC17xx_40xx GPIO Port 1",
        0x0106,
        LPC17xx_40xx_GPIO_Port1_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC17xx_40xx_GPIO_EnableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_DisableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_ClearInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC17xx_40xx_Port2_Interface = {
        {
        "LPC17xx_40xx GPIO Port 2",
        0x0106,
        LPC17xx_40xx_GPIO_Port2_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback,
        LPC17xx_40xx_GPIO_EnableInterrupts,
        LPC17xx_40xx_GPIO_DisableInterrupts,
        LPC17xx_40xx_GPIO_ClearInterrupts,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC17xx_40xx_Port3_Interface = {
        {
        "LPC17xx_40xx GPIO Port 3",
        0x0106,
        LPC17xx_40xx_GPIO_Port3_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC17xx_40xx_GPIO_EnableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_DisableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_ClearInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC17xx_40xx_Port4_Interface = {
        {
        "LPC17xx_40xx GPIO Port 4",
        0x0106,
        LPC17xx_40xx_GPIO_Port4_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

