FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPIO.c
        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC17xx_40xx_GPIO_EnableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_DisableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_ClearInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC17xx_40xx_Port5_Interface = {
        {
        "LPC17xx_40xx GPIO Port 5",
        0x0106,
        LPC17xx_40xx_GPIO_Port5_InitializeWorkspace,
        sizeof(T_LPC17xx_40xx_GPIO_Workspace),
        },

        LPC17xx_40xx_GPIO_Configure,
        LPC17xx_40xx_GPIO_Activate,
        LPC17xx_40xx_GPIO_Deactivate,
        LPC17xx_40xx_GPIO_SetOutputMode,
        LPC17xx_40xx_GPIO_SetInputMode,
        LPC17xx_40xx_GPIO_Set,
        LPC17xx_40xx_GPIO_Clear,
        LPC17xx_40xx_GPIO_Read,
        LPC17xx_40xx_GPIO_SetPull,
        LPC17xx_40xx_GPIO_SetMux,
        LPC17xx_40xx_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC17xx_40xx_GPIO_EnableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_DisableInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_ClearInterrupts_NotSupported,
        LPC17xx_40xx_GPIO_Control,
        LPC17xx_40xx_GPIO_Lock,
        LPC17xx_40xx_GPIO_Unlock,
        LPC17xx_40xx_GPIO_GetMux };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_GPIO0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void LPC17xx_40xx_GPIO1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO1 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void LPC17xx_40xx_GPIO2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO2 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void LPC17xx_40xx_GPIO3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO3 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void LPC17xx_40xx_GPIO4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO4 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

void LPC17xx_40xx_GPIO5_Require(void)
{
    HAL_GPIOPort **p_gpio5;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO5 and allow all pins
    HALInterfaceRegister("GPIO5",
            (T_halInterface *)&GPIO_LPC17xx_40xx_Port5_Interface, 0,
            (T_halWorkspace **)&p_gpio5);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_5, p_gpio5);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
